using System;
using System.Runtime.InteropServices;
namespace FocasLibrary
{
    public enum CncMachineType
    {
        cncUnknown,
        Series150i,
        Series160i,
        Series180i,
        Series160i180iW,
        Series210i,
        Series0i,
        Series300i,
        Series310i,
        Series320i,
        Series350i,
        SeriesPowerMateiD,
        SeriesPowerMateiH
    }
       
    public enum focas_ret
    {
        DNC_CANCEL = -32768,
        DNC_NOFILE = -516,
        DNC_NORMAL = -1,
        DNC_OPENERR = -514,
        DNC_READERR = -517,
        EW_ALARM = 15,
        EW_ATTRIB = 4,
        EW_BUFFER = 10,
        EW_BUS = -11,
        EW_BUSY = -1,
        EW_DATA = 5,
        EW_DTSRVR = 14,
        EW_FUNC = 1,
        EW_HANDLE = -8,
        EW_HSSB = -9,
        EW_LENGTH = 2,
        EW_MMCSYS = -3,
        EW_MODE = 12,
        EW_NODLL = -15,
        EW_NOOPT = 6,
        EW_NOPMC = 1,
        EW_NUMBER = 3,
        EW_OK = 0,
        EW_OVRFLOW = 8,
        EW_PARAM = 9,
        EW_PARITY = -4,
        EW_PASSWD = 0x11,
        EW_PATH = 11,
        EW_PROT = 7,
        EW_PROTOCOL = -17,
        EW_RANGE = 3,
        EW_REJECT = 13,
        EW_RESET = -2,
        EW_SOCKET = -16,
        EW_STOP = 0x10,
        EW_SYSTEM = -5,
        EW_SYSTEM2 = -10,
        EW_TYPE = 4,
        EW_UNEXP = -6,
        EW_VERSION = -7
    }

    public class FocasLibBase
    {
        public const short ALL_AXES = -1;

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class DSMNTINFO
        {
            public ushort empty_cnt;
            public uint total_size;
            public ushort ReadPtr;
            public ushort WritePtr;
        }

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class ETBPRM
        {
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=13)]
            public string OwnMACAddress = new string(' ', 0x80);
            public short MaximumChannel;
            public short HDDExistence;
            public short NumberOfScreens;
        }

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class FAXIS
        {
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] absolute;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] machine;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] relative;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] distance;
        }        

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class FTPPRM
        {
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x20)]
            public string FTPServerUserName = new string(' ', 0x20);
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x20)]
            public string FTPServerPassword = new string(' ', 0x20);
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x80)]
            public string FTPServerLoginDirectory = new string(' ', 0x80);
        }

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class GASFLOW
        {
            public short slct;
            public short pre_time;
            public short pre_press;
            public short proc_press;
            public short end_time;
            public short end_press;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=3)]
            public short[] reserve = new short[3];
        }

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class HOSTPRM
        {
            public short DataServerPort;
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x10)]
            public string DataServerIPAddress = new string(' ', 0x10);
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x20)]
            public string DataServerUserName = new string(' ', 0x20);
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x20)]
            public string DataServerPassword = new string(' ', 0x20);
            [MarshalAs(UnmanagedType.ByValTStr, SizeConst=0x80)]
            public string DataServerLoginDirectory = new string(' ', 0x80);
        }

        [StructLayout(LayoutKind.Explicit)]
        public class HSPDATA_1
        {
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0)]
            public byte[] cdatas1 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x120)]
            public byte[] cdatas10 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x20)]
            public byte[] cdatas2 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x40)]
            public byte[] cdatas3 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x60)]
            public byte[] cdatas4 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x80)]
            public byte[] cdatas5 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(160)]
            public byte[] cdatas6 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0xc0)]
            public byte[] cdatas7 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0xe0)]
            public byte[] cdatas8 = new byte[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x100)]
            public byte[] cdatas9 = new byte[8];
        }

        [StructLayout(LayoutKind.Explicit)]
        public class HSPDATA_2
        {
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0)]
            public short[] idatas1 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x90)]
            public short[] idatas10 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x10)]
            public short[] idatas2 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x20)]
            public short[] idatas3 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x30)]
            public short[] idatas4 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x40)]
            public short[] idatas5 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(80)]
            public short[] idatas6 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x60)]
            public short[] idatas7 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x70)]
            public short[] idatas8 = new short[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8), FieldOffset(0x80)]
            public short[] idatas9 = new short[8];
        }

        [StructLayout(LayoutKind.Sequential, Pack=4)]
        public class HSPDATA_3
        {
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas1 = new int[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas2 = new int[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas3 = new int[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas4 = new int[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas5 = new int[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas6 = new int[8];
            [MarshalAs(UnmanagedType.ByValArray, SizeConst=8)]
            public int[] ldatas7 = new int[8];
